from tqdm import tqdm
region_dic = {
    "01" : "北海道",
    "02" : "青森",
    "03" : "岩手",
    "04" : "宮城",
    "05" : "秋田",
    "06" : "山形",
    "07" : "福島",
    "08" : "茨城",
    "09" : "栃木",
    "10" : "群馬",
    "11" : "埼玉",
    "12" : "千葉",
    "13" : "東京",
    "14" : "神奈川",
    "15" : "山梨",
    "16" : "長野",
    "17" : "新潟",
    "18" : "富山",
    "19" : "石川",
    "20" : "福井",
    "21" : "静岡",
    "22" : "愛知",
    "23" : "三重",
    "24" : "岐阜",
    "25" : "滋賀",
    "26" : "京都",
    "27" : "大阪",
    "28" : "兵庫",
    "29" : "奈良",
    "30" : "和歌山",
    "31" : "鳥取",
    "32" : "島根",
    "33" : "岡山",
    "34" : "広島",
    "35" : "山口",
    "36" : "香川",
    "37" : "徳島",
    "38" : "愛媛",
    "39" : "高知",
    "40" : "福岡",
    "41" : "佐賀",
    "42" : "長崎",
    "43" : "熊本",
    "44" : "大分",
    "45" : "宮崎",
    "46" : "鹿児島",
    "47" : "沖縄",
    "48" : "学連関東",
    "49" : "学連中部",
    "50" : "学連関西",
    "51" : "学連中・四国",
    "52" : "学連九州",
    "53" : "学連北部",
    "70" : "全国大会",
    "80" : "国際大会"
}
region_list = [
    "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16",
    "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32",
    "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48",
    "49", "50", "51", "52", "53", "70", "80"
]
path = "tables2017/all_2017.csv"

for region in tqdm(region_list):
    # startT = time()
    region_name = region_dic[region]
    targetPath = "tables2017/{}_2017.csv".format(region_name)
    with open(targetPath, "r", encoding="utf-8-sig") as f:
        str = f.read()

    with open(path, "a", encoding="utf-8-sig") as f2:
        f2.write(str)
